Ks_0.33/0/phib
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    object      phib;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    bed
    {
        type            calculated;
        value           uniform 0.0;
    }

    top
    {
        type            calculated;
        value           uniform 0.0;
    }

    bridge
    {
        type            calculated;
        value           uniform 0.0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
